[
  {
    "index": 1,
    "title": "HOME LOAN",
    "description": "Home loans help you realize your dream of owning a house. You do not need to break your savings and investments or impact your other important financial goals such as children’s higher education or retirement. The loan comes with a host of benefits and features. However, before applying for home loans, you should be aware of every aspect. So, here we are unravelling everything related to the housing loans so that you make an informed choice.\n\nFeatures and benefits of home loans\n\nEasy availability: All the financial institutions and NBFCs are offering attractive housing loan schemes. One can avail of the home loan after checking their eligibility to meet his/her requirements.\n\nMulti-Purpose: Housing loans are multi-purpose loans that are available for various purposes such as buying a new residential flat or building, constructing a new house on a plot, home renovation, or extending your current house.\n\nLower interest rate: Being a secured loan, home loans are generally subject to lower rates of interest as compared to other financing options.\n\nFast loan processing: Home loans involve lenient eligibility criteria and minimal documentation. This enables financial institutions and NBFCs to process the loan amount faster.\n\nLong Tenure: Since the loan amount involved in housing loans is high, the tenure to repay that loan can go up to as high as 30 years. This allows the borrower to choose an affordable EMI and ensure that his monthly budgets are not under any kind of pressure.\n\nTax benefits: You can claim a tax deduction of Rs. 1.5 lakhs on the principal repayment under Section 80 C and Rs. 2 lakhs on the interest repayment under Section 24 B. You can also claim a home loan tax deduction when you pay for the registration fees and stamp duty charges under Section 80C.\n\n Note: The Union Budget 2020 specifies an additional deduction of Rs. 1.5 lakh for interest repayment on home loan taken by 31 March 2021 under Section 80EEA, to purchase a house costing up to Rs. 45 lakhs. This additional deduction is being provided over and above the existing 2 lakh deduction.\n\nBalance transfer facility: With the help of a home loan balance transfer facility, you can refinance your existing home loan to another bank that is offering lower interest rates or better loan terms.\n\nTop-up loan facility: In a top-up loan facility, you can borrow an additional sum over and above your existing home loan and use it for any personal or business purposes.\n\nBasic eligibility criteria for a home loan\n\nHome loan eligibility criteria differ from one financial institution to another. However, the basic criteria required to get home loans are given below- \n\nAge: The minimum and maximum age should be at least 18 years or a maximum of 70 years\n\nIncome: The minimum monthly income should be at least Rs. 20,000 and above (varies across financial institutions & locations)\n\nResident Type: The applicant can be either a Resident Indian, Non-Resident India (NRI), or Person of Indian Origin (PIO)\n\nEmployment Status: Salaried or Non-Salaried\n\nCredit Score: 750 or above with a good credit history\n\nLoan-To-Value Ratio: 90% of the property value\n\nWork Experience: 2 Years\n\nResidence: Permanent resident or Non-resident Indian (NRI)\n\nUseful tips for first home loan buyers\n\nIf you are buying a house for the first time, you may already have explored many home loans options in the market. You may also be anxious about many factors such as the interest rates, the loan amount, margin, etc., as a home loan is a long-time commitment. Therefore, to make your house search easier, we have provided some tips below which will ease your anxiety around home loans.\n\nFirstly, you need to evaluate your financial position and check whether you can afford to repay your home loan EMIs. Do check your savings and see if you have enough money to make a down payment.\n\nIf you want to get the best deals on a home loan, you will need to shop around and check the rate of interest offered by the financial institution. This will help you to avail of a home loan at a low rate of interest. Also, do not forget to use the online financial tool known as home loan EMI calculator to calculate your monthly EMIs.\n\n You can also take advantage of affordable housing schemes offered by the reputed financial institutions on the home loan. First time home buyers can avail of a subsidy on the interest rates and NIL processing fee.\n\n You need to choose your loan tenure wisely. Choose a shorter loan tenure instead of opting for a longer tenure. This will help you to save lots of your money which you would have spent paying the interest. \n\nIt is advisable to buy a house within your means and at the proper location. Also, make sure that the builder is reputable from which you are buying a property. As lenders do have a look at the builder’s reputation before approving your home loan.\n\nDocuments required\n\nApplication Form: Signed Application form with your latest passport-sized photographs\n\nProof of Identity: Photocopy of any of the documents such as PAN Card, Passport, Aadhaar Card, Voter’s ID Card, and Driving License\n\nProof of Age: Photocopy of any of the documents such as Aadhaar Card, PAN Card, Passport, Birth Certificate, 10th Class Mark-sheet, Bank Passbook, and Driving License\n\nProof of Residence: Photocopy of any of the documents such as Bank Passbook, Voter’s ID, Ration Card. Passport, Utility Bills (Telephone Bill, Electricity Bill, Water Bill, Gas Bill) and LIC Policy Receipt\n\nProof of Income for Salaried: Copy of Form 16, latest payslips, IT returns (ITR) of past 3 years, and investment proofs (if any)\n\nProof of Income for Self Employed: Details of ITR of last 3 years, Balance Sheet and Profit & Loss Account Statement of the Company/Firm, Business License Details and Proof of Business Address\n\nProperty-related Documents: NOC from Society/Builder, detailed estimate of the cost of construction of the house, registered sale deed, allotment letter, and an approved copy of the building plan\n\nNote: Please note the documents may vary from one financial institution to another. You might be asked for additional documents depending upon your financial institution."
  },
  {
    "index": 1,
    "title": "BUSINESS LOAN",
    "description": "How Does Business Loan Work?\n\nIndia ranks third in having the most extensive small business network in the world.\n\nEntrepreneurs can become successful by following their passion, ideas, and showing dedication to their work.\n\nHowever, micro and small industries also require money to grow and control their business and prosper in the market.\n\nNoting the number of small businesses cropping up in India, the government has introduced business loans to supply funds to micro, small, and medium enterprises (MSMEs).\n\nWhat is a Business Loan?\n\nA business loan is a loan primarily used for business reasons.\n\nLike all other loans, business loans also entail debt, which has to be repaid with interest.\n\nBusiness loans are of various types, such as SBA loans, mezzanine financing, asset-based financing, bank loans, invoice financing, microloans, online lenders, business cash advances, and cash flow loans.\n\nBusiness loans can be secured or unsecured.\n\nWith a secured loan, the borrower puts up a resource against the debt taken.\n\nIf the borrower cannot repay the debt, the moneylender has full rights to claim the asset pledged by the borrower.\n\nOn the other hand, unsecured loans do not have any security or pledge, though the lender can claim an asset of the borrower if the latter isn't able to repay the debt."
  },
  {
    "index": 1,
    "title": "GOLD LOAN",
    "description": "What is a Gold Loan?\n\nA loan against gold ornaments or jewellery loan is a secured credit option that borrowers can avail by pledging gold ornaments ranging from 18K to 24K as collateral. The sanctioned loan amount is a percentage of the pledged gold’s present market value.\n\nAvailing this type of secured loan is one of the easiest and quickest ways to acquire funds during emergencies. Owing to the growing popularity of this form of credit, many lenders are now offering gold loans at an attractive rate of interest. Alongside, while you are at it, remember to know about gold loan renewal processes.\n\nHow to Determine Maximum Gold Loan Value?\n\nIndia’s annual demand for gold over decades has only increased drastically; this trend doesn’t seem to end anytime soon.\n\nSeveral factors are taken into consideration when deciding the sanctioned loan amount in lieu of gold ornaments. Lenders evaluate the pledged gold’s weight and purity; based on these factors, current market value is determined.\n\nAs already stated, lenders approve a maximum of 75% of the pledged gold’s market value. For instance, if you are pledging gold ornaments worth Rs. 4 lakh, the sanctioned loan amount you will receive will not exceed Rs. 3 lakh. Besides, the granted LTV ratio will also depend on the loan tenure, the form of gold, and the borrower’s repayment capacity.\n\nThe above discussion must have helped establish an idea of the factors lenders consider when deciding gold loan value. Now, let’s discuss them one at a time:"
  },
  {
    "index": 1,
    "title": "EDUCATION LOAN",
    "description": "Many parents find themselves burdened by higher education costs, more so when their kid wishes to study abroad. What's more, the cost of studies has shot through the roof over the last few years. In the US, an MBA from a premier institution or an Ivy league school can cost up to Rs 1.5 crore! Parents find themselves torn when it comes to finances and this critical financial goal. However, youngsters now are also becoming independent and want to fund their higher education even if their parents have the money.\n\nIn either case, an education loan is a good idea and a commonly sought after resort. Pursuing higher studies usually involves high fees and an education loan comes in handy at this point. Banks provide education loans for graduation/PG, diploma or professional courses, at attractive interest rates. Here is a simple guide for you consisting of important points about student loans."
  },
  {
    "index": 1,
    "title": "CAR LOAN",
    "description": "Seem to buy a new or used car? Well, you must be excited then. Though, have you thought of the car loan? Most of us try to get the best deal on a new car, the lowest price possible. But, we only think of getting a loan on the amount we do not have. We rarely think of getting the best loan deal too. Here are a few important tips to guide you through the auto loan purchase process.\n\nYou need to calculate well in advance the amount of money you need to borrow as car loan. However, do not calculate this amount based on the ex-showroom price of your new car. Collect as many quotes as possible from multiple to get an idea of how much you would need as loan. If you calculate the auto loan amount based on the ex-showroom, you may end up having nothing extra in your wallet to pay off the taxes and car insurance.\n\nHowever, to know how much you would need as car loan, you would have to first calculate the amount you already have ready for your new or used car. Remember, the more you borrow as loan, the more cash you would have to re-pay with interest. So, try to keep the loan amount low. Also, loan lenders in India give you a loan only when they are sure you are able to re-pay. With the monthly EMI’s will you be able to afford the loan?\n\nAre you trading in your used car? If yes, then subtract the amount you would get while trading it in when calculating the amount to be borrowed as loan. Keep the auto loan value as low as possible. You will then have a lesser amount to repay, plus a lower interest too. Also, the interest rate depends on the amount of loan borrowed. So think wise.\n\nIf you’re trading in your car, don’t go by the dealer’s words blindly without making any research yourself. Search on the Internet the approximate value of your used car based on the model, the year of manufacture, distance traveled so far, the mileage it delivers, etc.\n\nDo you have any loans borrowed previously to repay? If yes, pay them off first. If there are too many loans already and it’s not possible to repay all of them at once, consolidate them. Having too many loans in your name does not give positive vibes to the lender. He needs to know that you have the potential to repay the car loan.\n\nAs for the interest, it’s advisable to calculate it online. As mentioned earlier, try getting multiple loan quotes so that you have an idea of the current interest rates. Compare the quotes you’ve collect, shortlist the ones offering the lowest interest rate and EMI, then negotiate with the lender to offer you an even lower interest rate, and go for the auto loan with the best rate.\n\nNext, after finalizing the deal, do not forget the paperwork. Read all the documents carefully, lest you’ll end up in a trap at a later stage. Get every point in the loan documents clear before offering your signature. Get clarity on all the payment and interest details."
  }
]
