[
  {
    "title": "HDFC Bank",
    "description": "Features of HDFC loan\n\nNo collateral or security required to avail a loan.\n\nLoan disbursal within a day of applying for the loan.\n\nHDFC loan interest rates range from 10.50% p.a. to 21.00% p.a.\n\nBorrowers can opt for the ‘Sarv Suraksha Pro’ policy, which provides a credit shield cover, an accidental hospitalisation cover, and a permanent disability/accidental death cover.\n\nBorrowers can also avail an optional insurance cover that will offer coverage against personal accidents and critical illnesses.",
    "url": "https://www.bankbazaar.com/hdfc-personal-loan.html"
  },
  {
    "title": "TurboLoan by cholamandalam",
    "description": "Features of the TurboLoan powered by Chola\n\nHere are some of the important features of the TurboLoan:\n\nNo guarantor required\n\nNo collateral required\n\nSame day disbursement\n\nLow interest rate\n\nInstant E-approval\n\nPaperless process\n\nNil documentation",
    "url": "https://www.bankbazaar.com/personal-loan/cholamandalam-finance.html"
  },
  {
    "title": "SBI Loan",
    "description": "Features and Benefits of SBI Pensioner Loan\n\nThe processing fee is nominal. Defence pensioners need not pay any processing fee.\n\nFast loan processing.\n\nThe loan is devoid of interest costs.\n\nIf you add credit into your loan account which will reduce the loan burden and interest.\n\nFor central government employees the minimum loan amount is Rs.25,000. The maximum is pension of 18 months with a different upper cap for different ages.\n\nFor defence employees the minimum loan amount is Rs.25,000. The maximum is 36 months’ Pension with a ceiling of RS 14.00 lac for Pensioners below 56 years. It is also pension of 18 months with a different upper cap for different ages.",
    "url": "https://www.bankbazaar.com/sbi-personal-loan.html"
  },
  {
    "title": "PNB Loan",
    "description": "Punjab National Bank offers personal loans up to Rs.20 lakh under the ‘loan Scheme for Public’ scheme at interest rates starting from just 8.90% p.a. The repayment tenure extends up to 72 months, and the processing fees levied is up to 1% of the loan amount.\n\nThe bank also offers loans of up to Rs.20 lakh under the ‘PNB Doctor’s Delight – loan Scheme to Doctor’ scheme for a maximum tenure of up to 84 months.\n\nThis lender offers personal loans to help you meet your immediate financial expenses. Whether you need to consolidate your debt, pay for your child’s wedding, take off on an exotic vacation, or anything of the sort, personal loans from Punjab National Bank can be availed at attractive rates to help you fulfill your dreams.",
    "url": "https://www.bankbazaar.com/punjab-national-bank-personal-loan.html"
  },
  {
    "title": "Axis Bank Loan",
    "description": "Features and Benefits of Axis Bank loan\n\nFlexible repayment tenures\n\nCompetitive interest rates\n\nSpecial offers for customers who have existing personal loans with other banks and want to lower their EMIs by transferring the loan to Axis Bank\n\nMultiple channels for repayment, including RTGS, NEFT, and ECS\n\nMinimal documentation and hassle-free application process",
    "url": "https://www.bankbazaar.com/axis-personal-loan.html"
  },
  {
    "title": "Canara Bank Loan",
    "description": "Features of Canara Bank loan\n\nEasy access to loans for various reasons like marriage, home renovation, higher education, etc.\n\nAffordable interest rates and other charges\n\nMinimal documentation process",
    "url": "https://www.bankbazaar.com/canara-bank-personal-loan.html"
  },
  {
    "title": "Mahindra Finance Loan",
    "description": "The personal loans from Mahindra Finance come with competitive rates of interest. Only Employees of the Mahindra Group and existing customers of Mahindra Finance are eligible to apply for these loans. These instant loans can be disbursed in as less as 2 days and feature easy documentation and flexible repayment options.\n\nLoan amount – Up to Rs.3 lakhApproval and disbursal of loan within 2 daysRepayment period – Up to 3 years",
    "url": "https://www.bankbazaar.com/personal-loan/mahindra-finance-personal-loan.html"
  },
  {
    "title": "IDBI Bank Loan",
    "description": "Features of IDBI loan\n\nIDBI personal loans are available as 3 variants:\n\nSalaried, self-employed professionals and pensioners\n\nSalary a/c in IDBI with built-in Overdraft (OD) facility\n\nSalary a/c in IDBI with built-in OD facility to IDBI Bank Pensioners",
    "url": "https://www.bankbazaar.com/idbi-personal-loan.html"
  }
]
